---
kind: property
id: P:Autodesk.Revit.DB.City.TimeZone
source: html/1895716c-8c63-aff7-e4b8-544eb0756e1d.htm
---
# Autodesk.Revit.DB.City.TimeZone Property

Time-zone in which the city resides

## Syntax (C#)
```csharp
public double TimeZone { get; }
```

## Remarks
A read only property that returns the time zone in which the city resides.
The value is in hours, ranging from +12 hours to -12 hours with 0 being GMT.